app/controllers/api_controller.rb

  def all_stages
    @stages = Stage.find(:all, :conditions => "latitude IS NOT NULL", :select => "name, latitude, longitude, id")
---
SELECT name, latitude, longitude, id FROM `stages` WHERE (latitude IS NOT NULL)